whik/mm32_2019_ncov/CMSIS/MM32W3xx.h
#define  USB_TOP_STATE                         ((uint16_t)0x0060)
#define  USB_TOP_STATE_0                       ((uint16_t)0x0020)
#define  USB_TOP_STATE_1                       ((uint16_t)0x0040)

/*******************  Bit definition for USB_INT_STATE register  *******************/
#define  USB_INT_STATE_RSTF                    ((uint16_t)0x0001)
#define  USB_INT_STATE_SUSPENDF                ((uint16_t)0x0002)
#define  USB_INT_STATE_RESUMF                  ((uint16_t)0x0004)
#define  USB_INT_STATE_SOFF                    ((uint16_t)0x0008)
#define  USB_INT_STATE_EPINTF                  ((uint16_t)0x0010)

/*******************  Bit definition for EP_INT_STATE register  *******************/
#define  EP_INT_STATE_EP0F                    ((uint16_t)0x0001)
#define  EP_INT_STATE_EP1F                    ((uint16_t)0x0002)
#define  EP_INT_STATE_EP2F                    ((uint16_t)0x0004)
#define  EP_INT_STATE_EP3F                    ((uint16_t)0x0008)
#define  EP_INT_STATE_EP4F                    ((uint16_t)0x0010)

/*******************  Bit definition for EP0_INT_STATE register  *******************/
#define  EPn_INT_STATE_SETUP                  ((uint16_t)0x0001)
#define  EPn_INT_STATE_END                    ((uint16_t)0x0002)
#define  EPn_INT_STATE_INNACK                 ((uint16_t)0x0004)
#define  EPn_INT_STATE_INACK                  ((uint16_t)0x0008)
#define  EPn_INT_STATE_INSTALL                ((uint16_t)0x0010)
#define  EPn_INT_STATE_OUTNACK                ((uint16_t)0x0020)
#define  EPn_INT_STATE_OUTACK                 ((uint16_t)0x0040)
#define  EPn_INT_STATE_OUTSTALL               ((uint16_t)0x0080)

/*******************  Bit definition for USB_INT_EN register  *******************/
#define  USB_INT_EN_RSTIE                     ((uint16_t)0x0001)
#define  USB_INT_EN_SUSPENDIE                 ((uint16_t)0x0002)
#define  USB_INT_EN_RESUMIE                   ((uint16_t)0x0004)
#define  USB_INT_EN_SOFIE                     ((uint16_t)0x0008)
#define  USB_INT_EN_EPINTIE                   ((uint16_t)0x0010)

/*******************  Bit definition for EP_INT_EN register  *******************/
#define  EP_INT_EN_EP0IE                      ((uint16_t)0x0001)
#define  EP_INT_EN_EP1IE                      ((uint16_t)0x0002)
#define  EP_INT_EN_EP2IE                      ((uint16_t)0x0004)
#define  EP_INT_EN_EP3IE                      ((uint16_t)0x0008)
#define  EP_INT_EN_EP4IE                      ((uint16_t)0x0010)

/*******************  Bit definition for EP0_INT_EN register  *******************/
#define  EPn_INT_EN_SETUPIE                   ((uint16_t)0x0001)
#define  EPn_INT_EN_ENDIE                     ((uint16_t)0x0002)
#define  EPn_INT_EN_INNACKIE                  ((uint16_t)0x0004)
#define  EPn_INT_EN_INACKIE                   ((uint16_t)0x0008)
#define  EPn_INT_EN_INSTALLIE                 ((uint16_t)0x0010)
#define  EPn_INT_EN_OUTNACKIE                 ((uint16_t)0x0020)
#define  EPn_INT_EN_OUTACKIE                  ((uint16_t)0x0040)
#define  EPn_INT_EN_OUTSTALLIE                ((uint16_t)0x0080)

///*******************  Bit definition for EP1_INT_STATE register  *******************/
//#define  EP1_INT_STATE_END                    ((uint16_t)0x0002)
//#define  EP1_INT_STATE_INNACK                 ((uint16_t)0x0004)
//#define  EP1_INT_STATE_INACK                  ((uint16_t)0x0008)
//#define  EP1_INT_STATE_INSTALL                ((uint16_t)0x0010)
//#define  EP1_INT_STATE_OUTNACK                ((uint16_t)0x0020)
//#define  EP1_INT_STATE_OUTACK                 ((uint16_t)0x0040)
//#define  EP1_INT_STATE_OUTSTALL               ((uint16_t)0x0080)

///*******************  Bit definition for EP2_INT_STATE register  *******************/
//#define  EP2_INT_STATE_END                    ((uint16_t)0x0002)
//#define  EP2_INT_STATE_INNACK                 ((uint16_t)0x0004)
//#define  EP2_INT_STATE_INACK                  ((uint16_t)0x0008)
//#define  EP2_INT_STATE_INSTALL                ((uint16_t)0x0010)
//#define  EP2_INT_STATE_OUTNACK                ((uint16_t)0x0020)
//#define  EP2_INT_STATE_OUTACK                 ((uint16_t)0x0040)
//#define  EP2_INT_STATE_OUTSTALL               ((uint16_t)0x0080)

///*******************  Bit definition for EP3_INT_STATE register  *******************/
//#define  EP3_INT_STATE_END                    ((uint16_t)0x0002)
//#define  EP3_INT_STATE_INNACK                 ((uint16_t)0x0004)
//#define  EP3_INT_STATE_INACK                  ((uint16_t)0x0008)
//#define  EP3_INT_STATE_INSTALL                ((uint16_t)0x0010)
//#define  EP3_INT_STATE_OUTNACK                ((uint16_t)0x0020)
//#define  EP3_INT_STATE_OUTACK                 ((uint16_t)0x0040)
//#define  EP3_INT_STATE_OUTSTALL               ((uint16_t)0x0080)

///*******************  Bit definition for EP4_INT_STATE register  *******************/
//#define  EP4_INT_STATE_END                    ((uint16_t)0x0002)
//#define  EP4_INT_STATE_INNACK                 ((uint16_t)0x0004)
//#define  EP4_INT_STATE_INACK                  ((uint16_t)0x0008)
//#define  EP4_INT_STATE_INSTALL                ((uint16_t)0x0010)
//#define  EP4_INT_STATE_OUTNACK                ((uint16_t)0x0020)
//#define  EP4_INT_STATE_OUTACK                 ((uint16_t)0x0040)
//#define  EP4_INT_STATE_OUTSTALL               ((uint16_t)0x0080)

///*******************  Bit definition for EP1_INT_EN register  *******************/
//#define  EPn_INT_EN_ENDIE                     ((uint16_t)0x0002)
//#define  EPn_INT_EN_INNACKIE                  ((uint16_t)0x0004)
//#define  EPn_INT_EN_INACKIE                   ((uint16_t)0x0008)
//#define  EPn_INT_EN_INSTALLIE                 ((uint16_t)0x0010)
//#define  EPn_INT_EN_OUTNACKIE                 ((uint16_t)0x0020)
//#define  EPn_INT_EN_OUTACKIE                  ((uint16_t)0x0040)
//#define  EPn_INT_EN_OUTSTALLIE                ((uint16_t)0x0080)

/*******************  Bit definition for USB_ADDR register  *******************/
#define  USB_ADDR_ADDR                        ((uint16_t)0x007F)

/*******************  Bit definition for EP_EN register  *******************/
#define  EP_EN_EP0EN                        ((uint16_t)0x0001)
#define  EP_EN_EP1EN                        ((uint16_t)0x0002)
#define  EP_EN_EP2EN                        ((uint16_t)0x0004)
#define  EP_EN_EP3EN                        ((uint16_t)0x0008)
#define  EP_EN_EP4EN                        ((uint16_t)0x0010)

/*******************  Bit definition for TOG_CTRL1_4 register  *******************/
#define  TOG_CTRL1_4_DTOG1                  ((uint16_t)0x0001)
#define  TOG_CTRL1_4_DTOG1EN                ((uint16_t)0x0002)
#define  TOG_CTRL1_4_DTOG2                  ((uint16_t)0x0004)
#define  TOG_CTRL1_4_DTOG2EN                ((uint16_t)0x0008)
#define  TOG_CTRL1_4_DTOG3                  ((uint16_t)0x0010)
#define  TOG_CTRL1_4_DTOG3EN                ((uint16_t)0x0020)
#define  TOG_CTRL1_4_DTOG4                  ((uint16_t)0x0040)
#define  TOG_CTRL1_4_DTOG4EN                ((uint16_t)0x0080)

/*******************  Bit definition for SETUP0 register  *******************/
#define  SETUP0                             ((uint16_t)0x00FF)

/*******************  Bit definition for SETUP1 register  *******************/
#define  SETUP1                             ((uint16_t)0x00FF)

